saaj-ri/src/test/bugfixes/data/quot.xml

<?xml version='1.0' encoding='UTF-8'?>
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 1997-2017 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://oss.oracle.com/licenses/CDDL+GPL-1.1
    or LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<soap:Envelope xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soapenc='http://schemas.xmlsoap.org/soap/encoding/' xmlns:n='http://www.routeone.com/DealerInfoImpl' xmlns:n5='http://www.routeone.com/'>
  <SOAP:Header xmlns:SOAP='http://schemas.xmlsoap.org/soap/envelope/' xmlns:SOAP-SEC='http://schemas.xmlsoap.org/soap/security/2000-12'>
    <SOAP-SEC:Signature SOAP:mustUnderstand='1'>
      <Signature xmlns='http://www.w3.org/2000/09/xmldsig#' xmlns:wsse='http://schemas.xmlsoap.org/ws/2002/07/secext'>
        <SignedInfo>
          <CanonicalizationMethod Algorithm='http://www.w3.org/TR/2001/REC-xml-c14n-20010315'></CanonicalizationMethod>
          <SignatureMethod Algorithm='http://www.w3.org/2000/09/xmldsig#rsa-sha1'></SignatureMethod>
          <Reference URI='#Body'>
            <Transforms>
              <Transform Algorithm='http://www.w3.org/TR/2001/REC-xml-c14n-20010315'></Transform>
            </Transforms>
            <DigestMethod Algorithm='http://www.w3.org/2000/09/xmldsig#sha1'></DigestMethod>
            <DigestValue>2O9pnrEVW9lt69dRvuWxX/aYzLU=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>n7+4iRgBv9aSQiw03SU+c8uBq9gLmdo0nAQ1qpmaibBP54MLUHL0J7nLa3XE
        6SJwtiBILBfIDhCHz5FKipx2DVT3PnotHOBoNF0q5jCQGSbNuEqTBKCDpW55TPWtI77CKFfQ9217c3ht
        Z26OYPVLDNzlcm63M1Z0a9evZbZLiYEDFTYLq9RtdrDEchRTixoS/COFG8uDSzSl5AK52Ed4a7CDnr9d
        54nWkiKXQDeFCK3M1GxYBDWKkhYR+cT08P2f5eZTYQTJcp3qmH8tbu3I6IjLm9gx8J/+V5NT6+rdaev1
        /v890Aj44WS+S2bD4wHglw/Yiw31BqNfQeadJNYGLg==</SignatureValue>
        <KeyInfo>
          <X509Data>
            <X509Certificate></X509Certificate>
            <X509IssuerSerial>
              <X509IssuerName>CN=VeriSign Class 3 Code Signing 2001 CA, OU=Terms of use at https://www.verisign.com/rpa (c)01, OU=VeriSign Trust Network, O=&quot;VeriSign, Inc.&quot;</X509IssuerName>
              <X509SerialNumber>109767361091610589892618707245943051773</X509SerialNumber>
            </X509IssuerSerial>
          </X509Data>
        </KeyInfo>
      </Signature>
    </SOAP-SEC:Signature>
  </SOAP:Header>
  <soap:Body id='Body' soap:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/' xmlns:SOAP='http://schemas.xmlsoap.org/soap/envelope/' xmlns:SOAP-SEC='http://schemas.xmlsoap.org/soap/security/2000-12'>
    <n:getDealerInfo>
      <dealerInfoSelectionCriteria xsi:type='n5:DealerInfoParams'>
        <dealerId>AA0AA</dealerId>
        <financeSourceId>F000FA</financeSourceId>
        <captiveUserId>FC99951</captiveUserId>
      </dealerInfoSelectionCriteria>
    </n:getDealerInfo>
  </soap:Body>
</soap:Envelope>
